#+TITLE:     Lab Project
#+AUTHOR:    Dale Barr
#+EMAIL:     daleb@daleb-pc
#+DATE:      2012-11-07 Wed
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:

** Analyses

- 3/22 pilot participants used modifiers more than half of the time in
  the last training/singleton condition.  we threw these three away

- also, throw away any trials where the speaker did not adequately
  specify the target in the last training trial (in the pilot; this
  meant throwing away 5 of the remaining 437 (1) % of trials)

#+BEGIN_SRC R :noweb yes :session *R*
  <<comfun>>

  pencode <- read.csv(file="pilot_penultimate_trials/pilot_penultimate_coding.csv")

  onset_no <- read.csv(file="pilot_penultimate_trials/onset_lt_noadj2.csv") %>%
      filter(!is.na(onset_ms), adj==0) %>%
      mutate(SessionID=as.numeric(substr(sessionID, 2, 4)),
             AdjReq=FALSE) %>%
      select(SessionID, Series=series, Onset=onset_ms, AdjReq)

  onset_adj <- read.csv(file="pilot_penultimate_trials/onset_lt_adj2.csv") %>%
      filter(!is.na(onset_ms), postnom==0) %>%
      mutate(SessionID=as.numeric(substr(sessionID, 2, 4)),
             AdjReq=TRUE) %>%
      select(SessionID, Series=series, Onset=onset_ms, AdjReq)

  onset <- rbind(onset_no, onset_adj) %>% rename(PrevOnset=Onset)

  fcode <- read.csv(file="pilot/coding2.csv") %>%
      mutate(Series=GridID) %>% select(-GridID)

  full <- inner_join(ultimate, penultimate) %>%
      left_join(pencode) %>%
          mutate(Corr=ifelse(is.na(Corr), 1, Corr)) %>%
              inner_join(fcode, by=c("SessionID","Series"))

  goodsess <- full %>% group_by(SessionID) %>%
      filter(ShiftDir=="SC") %>%
      summarize(mCorr=mean(Corr)) %>%
      filter(mCorr>.5)

  dat <- goodsess %>%
      inner_join(full) %>%
          mutate(Onset=ifelse(Mis,
                     ifelse(is.na(AdjMs), NounMs, AdjMs),
                     ifelse(ShiftDir=="SC", AdjMs, NounMs)),
                 S=(ShiftDir=="SC"), D=(Dist=="H"),
                 Sc=S-mean(S), Dc=D-mean(D)) %>%
                         select(SessionID, Series, ShiftDir, Dist, Corr, AdjMs, NounMs, Mis,
                                Ideal, Onset, Sc, Dc, Transcription) %>%
      inner_join(onset, by=c("SessionID", "Series")) %>%
      mutate(Diff=Onset-PrevOnset)

  saveRDS(dat, file="pilot/dat.rds")

#+END_SRC

#+BEGIN_SRC R :session *R* :exports results :results value :colnames yes
  dat %>% group_by(SessionID, ShiftDir) %>%
      summarize(mCorr=sum(Corr), N=n(), discard=N-mCorr) %>%
      ungroup() %>% summarize(totN=sum(N), totD=sum(discard))
#+END_SRC

#+RESULTS:
| totN | totD |
|------+------|
|  437 |    5 |

#+BEGIN_SRC R :session *R* :exports results :results value :colnames yes
  dat %>%
      filter(Corr==1) %>%
      group_by(ShiftDir, Dist) %>%
          summarize(mOnset=round(mean(Onset, na.rm=TRUE)),
                    mPrev=round(mean(PrevOnset, na.rm=TRUE)),
                    mDiff=round(mean(Diff, na.rm=TRUE)),
                    mMis=round(mean(Mis),3), nMis=sum(Mis),
                    mIdeal=round(mean(Ideal),3), nIdeal=sum(Ideal), nTot=n())
#+END_SRC

#+RESULTS:
| ShiftDir | Dist | mOnset | mPrev | mDiff |  mMis | nMis | mIdeal | nIdeal | nTot |
|----------+------+--------+-------+-------+-------+------+--------+--------+------|
| CS       | H    |   1483 |  1159 |   324 | 0.176 |   19 |  0.741 |     80 |  108 |
| CS       | L    |   1504 |  1161 |   344 | 0.186 |   21 |  0.699 |     79 |  113 |
| SC       | H    |   1421 |  1321 |   100 | 0.163 |   17 |  0.683 |     71 |  104 |
| SC       | L    |   1408 |  1214 |   194 | 0.243 |   26 |  0.607 |     65 |  107 |

#+BEGIN_SRC R :session *R* :exports results :results value :colnames yes
  bymis <- dat %>%
      filter(Corr==1) %>%
      group_by(Mis, ShiftDir, Dist) %>%
          summarize(mOnset=round(mean(Onset, na.rm=TRUE)),
                    mPrev=round(mean(PrevOnset, na.rm=TRUE)),
                    mDiff=round(mean(Diff, na.rm=TRUE)),
                    mIdeal=round(mean(Ideal),3), nIdeal=sum(Ideal), nTot=n())
#+END_SRC

#+RESULTS:
| Mis   | ShiftDir | Dist | mOnset | mPrev | mDiff | mIdeal | nIdeal | nTot |
|-------+----------+------+--------+-------+-------+--------+--------+------|
| FALSE | CS       | H    |   1543 |  1203 |   340 |  0.899 |     80 |   89 |
| FALSE | CS       | L    |   1634 |  1198 |   436 |  0.859 |     79 |   92 |
| FALSE | SC       | H    |   1374 |  1361 |    13 |  0.816 |     71 |   87 |
| FALSE | SC       | L    |   1360 |  1250 |   110 |  0.802 |     65 |   81 |
| TRUE  | CS       | H    |   1205 |   956 |   249 |      0 |      0 |   19 |
| TRUE  | CS       | L    |    936 |   998 |   -62 |      0 |      0 |   21 |
| TRUE  | SC       | H    |   1661 |  1120 |   541 |      0 |      0 |   17 |
| TRUE  | SC       | L    |   1557 |  1103 |   454 |      0 |      0 |   26 |

#+BEGIN_SRC R :exports results :results value :colnames yes
  prev <- dat %>%
      filter(Corr==1) %>%
      group_by(ShiftDir, Dist) %>%
          summarize(mOnset=round(mean(Onset, na.rm=TRUE)),
                    mPrev=round(mean(PrevOnset, na.rm=TRUE)),
                    mDiff=round(mean(Diff, na.rm=TRUE)),
                    mIdeal=round(mean(Ideal),3), nIdeal=sum(Ideal), nTot=n())
#+END_SRC

#+RESULTS:
| ShiftDir | Dist | mOnset | mPrev | mDiff | mIdeal | nIdeal | nTot |
|----------+------+--------+-------+-------+--------+--------+------|
| CS       | H    |   1483 |  1159 |   324 |  0.741 |     80 |  108 |
| CS       | L    |   1504 |  1161 |   344 |  0.699 |     79 |  113 |
| SC       | H    |   1421 |  1321 |   100 |  0.683 |     71 |  104 |
| SC       | L    |   1408 |  1214 |   194 |  0.607 |     65 |  107 |

#+BEGIN_SRC R :exports results :results output graphics :file barplot.pdf :width 12 :height 12
  bplot <- function(x, plottitle) {
      barplot(matrix(x, nrow=2,
                 dimnames=list(Dist=c("H","L"), ShiftDir=c("CS","SC"))), beside=TRUE,
          legend=TRUE, main=plottitle)
  }

  par(mfrow=c(1,2))
  bplot(filter(bymis, !Mis)$mDiff, "onset delta (test-training), nonmisspecified")
  bplot(prev$mPrev, "onset previous trial")
#+END_SRC

#+RESULTS:
[[file:barplot.pdf]]

#+BEGIN_SRC R :colnames yes
  dat %>%
      filter(Corr==1) %>%
      group_by(Mis, Dist) %>%
          summarize(mOnset=round(mean(Onset, na.rm=TRUE)),
                    mPrev=round(mean(PrevOnset, na.rm=TRUE)),
                    mDiff=round(mean(Diff, na.rm=TRUE)),
                    nMis=sum(Mis),
                    mIdeal=round(mean(Ideal),3), nIdeal=sum(Ideal),
                    nTot=n())
#+END_SRC 

#+RESULTS:
| Mis   | Dist | mOnset | mPrev | mDiff | nMis | mIdeal | nIdeal | nTot |
|-------+------+--------+-------+-------+------+--------+--------+------|
| FALSE | H    |   1459 |  1281 |   179 |    0 |  0.858 |    151 |  176 |
| FALSE | L    |   1506 |  1222 |   284 |    0 |  0.832 |    144 |  173 |
| TRUE  | H    |   1420 |  1033 |   387 |   36 |      0 |      0 |   36 |
| TRUE  | L    |   1280 |  1056 |   224 |   47 |      0 |      0 |   47 |

#+BEGIN_SRC R :results output
  library(lme4)

  # get rid of trials where incorrect description given on previous trials
  prev.mod <- lmer(PrevOnset ~ Sc * Dc + (Sc*Dc | SessionID),
                   data=filter(dat, Corr==1),
                   REML=FALSE)

  summary(prev.mod)

  # get rid of trials where incorrect description given on previous trials
  # get rid of misspecified trials
  diff.mod <- lmer(Diff ~ D * SD + (D*SD | SessionID),
                  data=filter(dat, Corr==1, !Mis) %>% 
                     rename(SD=Sc, D=Dc), REML=FALSE)                
  summary(diff.mod)
  saveRDS(diff.mod, file="diff_mod.rds")

  # get rid of trials where incorrect description given on previous trials
  # mean center and re-scale previous onset (seconds)
  mis.mod <- glmer(Mis ~ PO + (PO | SessionID),
                   data=filter(dat, Corr==1) %>%
                       mutate(PO=PrevOnset/1000-mean(PrevOnset/1000, na.rm=TRUE)),
                   family=binomial(link=logit))
  summary(mis.mod)

  # get rid of trials where incorrect description given on previous trials
  mis.glmer <- glmer(Mis ~ Sc * Dc + (Sc*Dc | SessionID),
                     data=filter(dat, Corr==1),
                     family=binomial(link="logit"),
                     control=glmerControl(optimizer='bobyqa'))
  summary(mis.glmer)

  library(lme4)
  ideal.glmer <- glmer(Ideal ~ Sc * Dc + (Sc*Dc | SessionID),
                     data=filter(dat, Corr==1),
                     family=binomial(link="logit"),
                     control=glmerControl(optimizer='bobyqa'))
  summary(ideal.glmer)
#+END_SRC

#+RESULTS:
#+begin_example
Linear mixed model fit by maximum likelihood  ['lmerMod']
Formula: PrevOnset ~ Sc * Dc + (Sc * Dc | SessionID)
   Data: filter(dat, Corr == 1)

     AIC      BIC   logLik deviance df.resid 
  6471.3   6532.4  -3220.7   6441.3      417 

Scaled residuals: 
    Min      1Q  Median      3Q     Max 
-2.7898 -0.4748 -0.1209  0.3382  6.4201 

Random effects:
 Groups    Name        Variance Std.Dev. Corr             
 SessionID (Intercept)  75627   275.00                    
           Sc           10699   103.44   -0.08            
           Dc            8537    92.40   -0.39  0.95      
           Sc:Dc         1629    40.37    0.81  0.52  0.22
 Residual              153271   391.50                    
Number of obs: 432, groups:  SessionID, 19

Fixed effects:
            Estimate Std. Error t value
(Intercept)  1213.41      65.86  18.424
Sc            114.27      44.66   2.559
Dc             50.91      43.28   1.176
Sc:Dc         112.49      76.05   1.479

Correlation of Fixed Effects:
      (Intr) Sc     Dc    
Sc    -0.033              
Dc    -0.178  0.245       
Sc:Dc  0.094  0.051  0.034
Linear mixed model fit by maximum likelihood  ['lmerMod']
Formula: Diff ~ D * SD + (D * SD | SessionID)
   Data: filter(dat, Corr == 1, !Mis) %>% rename(SD = Sc, D = Dc)

     AIC      BIC   logLik deviance df.resid 
  5341.6   5399.4  -2655.8   5311.6      334 

Scaled residuals: 
    Min      1Q  Median      3Q     Max 
-4.9836 -0.4458 -0.0188  0.5042  2.9829 

Random effects:
 Groups    Name        Variance Std.Dev. Corr             
 SessionID (Intercept)  18562   136.24                    
           D             8021    89.56   -0.98            
           SD           97000   311.45   -0.23  0.40      
           D:SD         30366   174.26    0.67 -0.80 -0.87
 Residual              212031   460.47                    
Number of obs: 349, groups:  SessionID, 19

Fixed effects:
            Estimate Std. Error t value
(Intercept)   230.25      40.20   5.728
D             -96.90      53.74  -1.803
SD           -331.25      87.54  -3.784
D:SD           15.31     107.09   0.143

Correlation of Fixed Effects:
     (Intr) D      SD    
D    -0.307              
SD   -0.134  0.109       
D:SD  0.178 -0.077 -0.279
Generalized linear mixed model fit by maximum likelihood (Laplace
  Approximation) [glmerMod]
 Family: binomial  ( logit )
Formula: Mis ~ PO + (PO | SessionID)
   Data: 
filter(dat, Corr == 1) %>% mutate(PO = PrevOnset/1000 - mean(PrevOnset/1000,  
    na.rm = TRUE))

     AIC      BIC   logLik deviance df.resid 
   401.9    422.3   -196.0    391.9      427 

Scaled residuals: 
    Min      1Q  Median      3Q     Max 
-1.1073 -0.4624 -0.3640 -0.2025  3.4503 

Random effects:
 Groups    Name        Variance Std.Dev. Corr 
 SessionID (Intercept) 0.3223   0.5677        
           PO          2.7335   1.6533   -0.16
Number of obs: 432, groups:  SessionID, 19

Fixed effects:
            Estimate Std. Error z value Pr(>|z|)    
(Intercept)  -1.7679     0.2263  -7.812 5.63e-15 ***
PO           -1.4513     0.6786  -2.138   0.0325 *  
---
Signif. codes:  0 *** 0.001 ** 0.01 * 0.05 . 0.1   1

Correlation of Fixed Effects:
   (Intr)
PO 0.248
Generalized linear mixed model fit by maximum likelihood (Laplace
  Approximation) [glmerMod]
 Family: binomial  ( logit )
Formula: Mis ~ Sc * Dc + (Sc * Dc | SessionID)
   Data: filter(dat, Corr == 1)
Control: glmerControl(optimizer = "bobyqa")

     AIC      BIC   logLik deviance df.resid 
   418.7    475.6   -195.3    390.7      418 

Scaled residuals: 
    Min      1Q  Median      3Q     Max 
-1.5290 -0.4596 -0.3436 -0.1651  3.1490 

Random effects:
 Groups    Name        Variance Std.Dev. Corr             
 SessionID (Intercept) 0.9460   0.9726                    
           Sc          1.9618   1.4006   -0.53            
           Dc          0.3765   0.6136    0.78 -0.94      
           Sc:Dc       0.3207   0.5663   -0.97  0.71 -0.90
Number of obs: 432, groups:  SessionID, 19

Fixed effects:
            Estimate Std. Error z value Pr(>|z|)    
(Intercept)  -1.8309     0.2951  -6.205 5.47e-10 ***
Sc            0.4917     0.5016   0.980    0.327    
Dc           -0.5672     0.3949  -1.436    0.151    
Sc:Dc         0.0799     0.7516   0.106    0.915    
---
Signif. codes:  0 *** 0.001 ** 0.01 * 0.05 . 0.1   1

Correlation of Fixed Effects:
      (Intr) Sc     Dc    
Sc    -0.423              
Dc     0.430 -0.390       
Sc:Dc -0.279  0.348 -0.338
Generalized linear mixed model fit by maximum likelihood (Laplace
  Approximation) [glmerMod]
 Family: binomial  ( logit )
Formula: Ideal ~ Sc * Dc + (Sc * Dc | SessionID)
   Data: filter(dat, Corr == 1)
Control: glmerControl(optimizer = "bobyqa")

     AIC      BIC   logLik deviance df.resid 
     498      555     -235      470      418 

Scaled residuals: 
    Min      1Q  Median      3Q     Max 
-3.2709 -0.7324  0.3495  0.5524  1.8883 

Random effects:
 Groups    Name        Variance Std.Dev. Corr             
 SessionID (Intercept) 1.6427   1.2817                    
           Sc          0.6569   0.8105   -0.34            
           Dc          0.1690   0.4112    0.20 -0.97      
           Sc:Dc       0.2171   0.4660    0.92  0.04 -0.14
Number of obs: 432, groups:  SessionID, 19

Fixed effects:
            Estimate Std. Error z value Pr(>|z|)   
(Intercept)   1.0548     0.3261   3.235  0.00122 **
Sc           -0.5011     0.3300  -1.519  0.12887   
Dc            0.3740     0.2830   1.321  0.18639   
Sc:Dc         0.2417     0.5454   0.443  0.65773   
---
Signif. codes:  0 *** 0.001 ** 0.01 * 0.05 . 0.1   1

Correlation of Fixed Effects:
      (Intr) Sc     Dc    
Sc    -0.213              
Dc     0.121 -0.172       
Sc:Dc  0.176  0.128 -0.103
#+end_example

*** function for reporting

#+name: getpow
#+BEGIN_SRC R
  getpower <- function(x, effsign=c(-1, 1, -1)) {
      nsubj <- c(24, 36, 48)
      ff <- lapply(1:length(x), function(iix) {
          xx <- x[[iix]]
          twotail <-
              apply(xx, 1, function(xxx) {sum(abs(xxx)<.05, na.rm=TRUE)/sum(!is.na(xxx))})
          onetail.list <-
              lapply(1:nrow(xx), function(ix) {
                  (sign(xx[ix,])==effsign[ix]) & (abs(xx[ix,])<(2*.05))
              })
          onetail <- apply(matrix(unlist(onetail.list), nrow=length(onetail.list),
                 byrow=TRUE), 1, function(xxx) {sum(xxx)/length(xxx)})
          data.frame(subj=nsubj[iix], onetail=onetail, twotail=twotail)
      })
      do.call("rbind", ff)
  }
#+END_SRC

#+BEGIN_SRC R :colnames yes
  <<getpow>>

  # order in the list: 24, 36, and 48 subjects
  # distortion (-.5=Low), shiftdir (-.5=CS), interaction (neg --> bigger for low)
  power_analysis_mis <- readRDS("pilot/power_analysis_mis.rds")
  power_analysis_mis_half <- readRDS("pilot/power_analysis_mis_half.rds")
  power_analysis_ideal <- readRDS("pilot/power_analysis_ideal.rds")
  power_analysis_ideal_half <- readRDS("pilot/power_analysis_ideal_half.rds")

  getpower(power_analysis_mis, c(-1, 1, -1))
#+END_SRC R

- same as estimated effect size

#+RESULTS:
| subj | onetail | twotail |
|------+---------+---------|
|   24 |   0.684 |   0.572 |
|   24 |   0.493 |   0.369 |
|   24 |   0.029 |    0.03 |
|   36 |   0.854 |   0.767 |
|   36 |   0.643 |   0.529 |
|   36 |   0.036 |   0.058 |
|   48 |   0.939 |   0.893 |
|   48 |   0.779 |   0.668 |
|   48 |   0.019 |    0.06 |

- half of the estimated effect size

#+BEGIN_SRC R :colnames yes
  getpower(power_analysis_mis_half, c(-1, 1, -1))
#+END_SRC

#+RESULTS:
| subj | onetail | twotail |
|------+---------+---------|
|   24 |   0.242 |   0.144 |
|   24 |   0.514 |   0.393 |
|   24 |    0.03 |   0.041 |
|   36 |   0.358 |   0.238 |
|   36 |   0.664 |   0.545 |
|   36 |   0.033 |   0.051 |
|   48 |   0.436 |   0.323 |
|   48 |   0.782 |   0.672 |
|   48 |   0.019 |   0.052 |

#+BEGIN_SRC R :colnames yes
  getpower(power_analysis_ideal, c(1, -1, 1))
#+END_SRC

#+RESULTS:
| subj | onetail | twotail |
|------+---------+---------|
|   24 |   0.572 |   0.441 |
|   24 |   0.778 |   0.681 |
|   24 |   0.134 |   0.078 |
|   36 |   0.763 |   0.657 |
|   36 |    0.92 |   0.853 |
|   36 |   0.147 |    0.08 |
|   48 |   0.862 |   0.779 |
|   48 |   0.964 |   0.919 |
|   48 |    0.17 |   0.099 |

#+BEGIN_SRC R :colnames yes
  getpower(power_analysis_ideal_half, c(1, -1, 1))
#+END_SRC


*** report results

#+BEGIN_SRC R :noweb yes :colnames yes
  <<getpow>>

  power_diff <- readRDS("pilot/power_analysis_lat.rds")
  getpower(power_diff, c(-1, -1, 1))  
#+END_SRC

#+RESULTS:
| subj | onetail | twotail |
|------+---------+---------|
|   24 |   0.889 |   0.808 |
|   24 |   0.987 |   0.997 |
|   24 |   0.077 |   0.054 |
|   36 |   0.964 |   0.929 |
|   36 |   0.951 |       1 |
|   36 |   0.088 |   0.073 |
|   48 |   0.996 |   0.983 |
|   48 |   0.844 |       1 |
|   48 |    0.09 |   0.055 |

